espressif/esp-protocols/components/esp_websocket_client/examples/linux/sdkconfig.ci.coverage
CONFIG_GCOV_ENABLED=y
CONFIG_IDF_TARGET="linux"
CONFIG_IDF_TARGET_LINUX=y
CONFIG_ESP_EVENT_POST_FROM_ISR=n
CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=n
CONFIG_WEBSOCKET_URI="ws://localhost:8080"
CONFIG_WS_OVER_TLS_SERVER_AUTH=n
